<div class="alert alert-block alert-info">
    Import <b>Libraries</b>
</div>

In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import LabelEncoder

<div class="alert alert-block alert-info">
    1. <b>Data Gathering</b> : <a href="https://www.kaggle.com/datasets/rkiattisak/salaly-prediction-for-beginer?utm_source=chatgpt.com">Click Me</a>
    <br>
    2. <b>Data Loading</b>
</div>

In [2]:
df = pd.read_csv("Data.csv")
df

      Age  Gender  Education Level  Job Title  Years of Experience    Salary
0    32.0       1                0        159                  5.0   90000.0
1    28.0       0                1         17                  3.0   65000.0
2    45.0       1                2        130                 15.0  150000.0
3    36.0       0                0        101                  7.0   60000.0
4    52.0       1                1         22                 20.0  200000.0
..    ...     ...              ...        ...                  ...       ...
370  35.0       0                0        131                  8.0   85000.0
371  43.0       1                1         30                 19.0  170000.0
372  29.0       0                0         70                  2.0   40000.0
373  34.0       1                0        137                  7.0   90000.0
374  44.0       0                2        110                 15.0  150000.0

[375 rows x 6 columns]

<div class="alert alert-block alert-info">
    3. <b>Data Exploration</b>
</div>

In [3]:
df.head(6)

    Age  Gender  Education Level  Job Title  Years of Experience    Salary
0  32.0       1                0        159                  5.0   90000.0
1  28.0       0                1         17                  3.0   65000.0
2  45.0       1                2        130                 15.0  150000.0
3  36.0       0                0        101                  7.0   60000.0
4  52.0       1                1         22                 20.0  200000.0
5  29.0       1                0         81                  2.0   55000.0

In [4]:
df.tail(6)

      Age  Gender  Education Level  Job Title  Years of Experience    Salary
369  33.0       1                0         49                  4.0   60000.0
370  35.0       0                0        131                  8.0   85000.0
371  43.0       1                1         30                 19.0  170000.0
372  29.0       0                0         70                  2.0   40000.0
373  34.0       1                0        137                  7.0   90000.0
374  44.0       0                2        110                 15.0  150000.0

In [5]:
df.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [6]:
df.count()

Age                    373
Gender                 375
Education Level        375
Job Title              375
Years of Experience    373
Salary                 373
dtype: int64

In [7]:
df.describe()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
count,373.000000,375.000000,375.000000,375.000000,373.000000,373.000000
mean,37.431635,0.528000,0.549333,90.402667,10.030831,100577.345845
std,7.069073,0.510468,0.743667,46.790128,6.557007,48240.013482
min,23.000000,0.000000,0.000000,0.000000,0.000000,350.000000
25%,31.000000,0.000000,0.000000,50.000000,4.000000,55000.000000
50%,36.000000,1.000000,0.000000,96.000000,9.000000,95000.000000
75%,44.000000,1.000000,1.000000,132.500000,15.000000,140000.000000
max,53.000000,2.000000,3.000000,174.000000,25.000000,250000.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  373 non-null    float64
 1   Gender               375 non-null    int64
 2   Education Level      375 non-null    int64
 3   Job Title            375 non-null    int64
 4   Years of Experience  373 non-null    float64
 5   Salary               373 non-null    float64
dtypes: float64(3), int64(3)
memory usage: 17.7 KB

In [9]:
df.shape
print(f"Number of Rows: {df.shape[0]} and Number of Columns: {df.shape[1]}")

Number of Rows: 375 and Number of Columns: 6

In [10]:
df['Job Title'].unique()

array([159,  17, 130, 101,  22,  81,  93, 104,  82, 150, 158,  40,  36,
        96,  13,  89,  83, 116,  18, 102,   3, 172,  44,  98,  37, 157,
       160,  57, 112,  92,   6,   1,  19,  84, 167,  39,  95,  16, 103,
       169,  88,  85,   2, 162,  10,   0,  29,  41,  12,   5,  34, 171,
        38, 170, 156,  30, 115,  47,  21,  43,  14,   4, 118, 173,  99,
       166,  11, 153,  42,   9, 165, 106,   8,  56,  35,  46, 144,  91,
       164, 134, 168, 100,  76,  97,  87,  94, 122,  80, 143,   7,  20,
        45, 131,  15, 120, 161, 163, 110,  62,  86,  90,  61, 141,  66,
       121, 105, 152,  79, 154, 146,  73,  64,  54, 142,  49, 148,  65,
        70, 109,  32,  71, 111, 139,  53, 129,  59, 138,  28,  77, 149,
        31,  52, 132, 125,  50, 108, 147,  60,  25,  63, 174,  55, 136,
       124, 155,  69, 135, 128, 145,  33, 107,  23,  74, 126, 113,  27,
        48,  78, 133, 127, 117,  51,  75, 140,  68, 151,  72, 119, 123,
       114,  67,  26, 137,  58,  24], dtype=int64)

In [11]:
df.nunique()

Age                     31
Gender                   3
Education Level          4
Job Title              175
Years of Experience     28
Salary                  36
dtype: int64

In [12]:
df.isnull().sum()

Age                    2
Gender                 0
Education Level        0
Job Title              0
Years of Experience    2
Salary                 2
dtype: int64

<div class="alert alert-block alert-info">
    4. <b>Data Pre-Processing</b>
</div>

In [13]:
df = df.drop('Gender', axis=1)

In [14]:
# Mean, Median, Mode

df['Salary'].mean()
df['Salary'].median()
df['Salary'].mode()[0]

40000.0

In [21]:
# df['city'].fillna(df['city'].mode()[0], inplace=True)
# df['city'] = df['city'].fillna(df['city'].mode()[0])

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  373 non-null    float64
 1   Education Level      375 non-null    int64
 2   Job Title            375 non-null    int64
 3   Years of Experience  373 non-null    float64
 4   Salary               373 non-null    float64
dtypes: float64(3), int64(2)
memory usage: 14.8 KB

In [ ]:
# def fillNaObjectMode(cols):
    # for i in cols:
        # if i in df.columns:  # Safety check
            # df[i] = df[i].fillna(df[i].mode()[0])

# Use cleaned column names (with spaces or underscores)
# object_cols = ['']

# fillNaObjectMode(object_cols)

In [18]:
def fillNaIntMode(cols):   # ← Wrong name! Mode is bad for numbers
    for i in cols:
        if i in df.columns:
            df[i] = df[i].fillna(df[i].median())   # Use median for numbers!

# Correct columns with underscores
int_columns = ['Education Level', 'Job Title']

fillNaIntMode(int_columns)

In [19]:
# For Float Type
def fillnaFloatMean(cols):
    for i in cols:
        df[i] = df[i].fillna(df[i].mean())

columns = ['Age','Years of Experience','Salary']
fillnaFloatMean(columns)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  375 non-null    float64
 1   Education Level      375 non-null    int64
 2   Job Title            375 non-null    int64
 3   Years of Experience  375 non-null    float64
 4   Salary               375 non-null    float64
dtypes: float64(3), int64(2)
memory usage: 14.8 KB

<div class="alert alert-block alert-warning">
    <b>Manage Data Types</b>
</div>

In [21]:
# For Float Type
def changeFloatToInt(cols):
    for i in cols:
        df[i] = df[i].astype('int64')

columns = ['Age','Years of Experience','Salary']
changeFloatToInt(columns)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  375 non-null    int64
 1   Education Level      375 non-null    int64
 2   Job Title            375 non-null    int64
 3   Years of Experience  375 non-null    int64
 4   Salary               375 non-null    int64
dtypes: int64(5)
memory usage: 14.8 KB

In [23]:
from sklearn.preprocessing import LabelEncoder

def convert_everything_to_int64(df):
    # Step 1: Convert object/categorical columns to integer via LabelEncoder
    for col in df.columns:
        if df[col].dtype == 'object':
            df[col] = LabelEncoder().fit_transform(df[col].astype(str))

    # Step 2: Convert all columns to int64
    df = df.astype('int64')
    
    return df

df = convert_everything_to_int64(df)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  375 non-null    int64
 1   Education Level      375 non-null    int64
 2   Job Title            375 non-null    int64
 3   Years of Experience  375 non-null    int64
 4   Salary               375 non-null    int64
dtypes: int64(5)
memory usage: 14.8 KB

In [25]:
df.head(2)

   Age  Education Level  Job Title  Years of Experience  Salary
0   32                0        159                    5   90000
1   28                1         17                    3   65000

In [26]:
df.to_csv('Salary Data.csv', index=False, header=True)

In [27]:
df = pd.read_csv('Salary Data.csv')
df

     Age  Education Level  Job Title  Years of Experience  Salary
0     32                0        159                    5   90000
1     28                1         17                    3   65000
2     45                2        130                   15  150000
3     36                0        101                    7   60000
4     52                1         22                   20  200000
..   ...              ...        ...                  ...     ...
370   35                0        131                    8   85000
371   43                1         30                   19  170000
372   29                0         70                    2   40000
373   34                0        137                    7   90000
374   44                2        110                   15  150000

[375 rows x 5 columns]

<div class="alert alert-block alert-info">
    5. <b>Train - Test Splitting</b>
</div>

In [28]:
import pandas as pd
df = pd.read_csv('Salary Data.csv')
# df.info()
df.columns

Index(['Age', 'Education Level', 'Job Title', 'Years of Experience', 'Salary'], dtype='object')

In [29]:
X = df.drop('Salary', axis=1)   # Dependant columns / Input columns
y = df['Salary']                # Resultant columns / Output column

In [30]:
from sklearn.model_selection import train_test_split
train_X, test_X, train_y, test_y = train_test_split(X,y, test_size=0.3, shuffle=False) # 80:20, 70:30, 60:40

In [31]:
print(train_X.shape, train_y.shape)
print(test_X.shape, test_y.shape)

(262, 4) (262,)
(113, 4) (113,)

<div class="alert alert-block alert-info">
    6. <b>Regression / Model Training</b>
</div>

In [32]:
from sklearn.svm import SVR           # ← SVR = Support Vector Regressor
from sklearn.metrics import mean_squared_error, r2_score

In [33]:
model_svr = SVR(kernel='rbf')         # ya 'linear', 'poly' etc.
model_svr.fit(train_X, train_y)

# Prediction
pred_y = model_svr.predict(test_X)

In [34]:
print("MSE:", mean_squared_error(test_y, pred_y))
print("RMSE:", mean_squared_error(test_y, pred_y, squared=False))
print("R² Score:", r2_score(test_y, pred_y))

MSE: 2310914808.3874245
RMSE: 48071.975291092676
R² Score: -0.05679039150712706

c:\ProgramData\anaconda3\Lib\site-packages\sklearn\metrics\_regression.py:483: FutureWarning: 'squared' is deprecated in version 1.4 and will be removed in 1.6. To calculate the root mean squared error, use the function'root_mean_squared_error'.
  warnings.warn(

In [35]:
from sklearn.metrics import r2_score, mean_squared_error

pred_y = model_svr.predict(test_X)

# Accuracy-like metric
r2 = r2_score(test_y, pred_y)
print("R² Score (Regression Accuracy):", round(r2*100, 2), "%")

R² Score (Regression Accuracy): -5.68 %

In [36]:
import pickle
pickle.dump(model_svr, open('model_svr.pkl', 'wb'))   # Model Saving

In [37]:
import pickle
model_svc = pickle.load(open('model_svr.pkl', 'rb'))  # Model Loading